Autodesk.Revit.DB.DisplacementPathStyle
Used to control the graphical representation of a  DisplacementPath element.
Since:
2014

Autodesk.Revit.DB.DisplacementPathStyle.Jogged
A jogged path consisting of three straight lines is used to represent each
stage of the displacement.

Autodesk.Revit.DB.DisplacementPathStyle.Straight
A single straight line is used to represent each stage of the displacement.